app/views/brands/show.html.erb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."brand_id" = 1
---
<ul>
  <% @brand.vehicles.each do |v| %>

SELECT "customers".* FROM "customers" INNER JOIN "vehicles" ON "customers"."id" = "vehicles"."customer_id" WHERE "vehicles"."brand_id" = 1
---
<ul>
  <% @brand.customers.each do |c| %>